RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
  if (!loadApplConfigData())   // For Azure Credentials, Viessman Refresh-Token and threshold
  {
    Serial.println(F("Failed to read ConfigFile, using default values"));
  }

  //Local intialization. Once its business is done, there is no need to keep it around
  // Use this to default DHCP hostname to ESP8266-XXXXXX or ESP32-XXXXXX
  //ESPAsync_WiFiManager ESPAsync_wifiManager(&webServer, &dnsServer);
  // Use this to personalize DHCP hostname (RFC952 conformed)
  AsyncWebServer webServer(HTTP_PORT);

#if ( USING_ESP32_S2 || USING_ESP32_C3 )
  ESPAsync_WiFiManager ESPAsync_wifiManager(&webServer, NULL, "AsyncConfigOnStartup");
#else
  // RoSchmi
  //DNSServer dnsServer;
  AsyncDNSServer dnsServer;
  
  //dnsServer.start();
  
  
  ESPAsync_WiFiManager ESPAsync_wifiManager(&webServer, &dnsServer, "AsyncConfigOnStartup");
#endif

#if USE_CUSTOM_AP_IP 
  //set custom ip for portal
  // New in v1.4.0
  ESPAsync_wifiManager.setAPStaticIPConfig(WM_AP_IPconfig);
  //////
#endif

  ESPAsync_wifiManager.setMinimumSignalQuality(-1);

  // From v1.0.10 only
  // Set config portal channel, default = 1. Use 0 => random channel from 1-13
  ESPAsync_wifiManager.setConfigPortalChannel(0);
  //////

#if !USE_DHCP_IP    
    // Set (static IP, Gateway, Subnetmask, DNS1 and DNS2) or (IP, Gateway, Subnetmask). New in v1.0.5
    // New in v1.4.0
    ESPAsync_wifiManager.setSTAStaticIPConfig(WM_STA_IPconfig);
    //////
#endif

  // New from v1.1.1
#if USING_CORS_FEATURE
  ESPAsync_wifiManager.setCORSHeader("Your Access-Control-Allow-Origin");
#endif

  // We can't use WiFi.SSID() in ESP32 as it's only valid after connected.
  // SSID and Password stored in ESP32 wifi_ap_record_t and wifi_config_t are also cleared in reboot
  // So there are functions to store and retrieve the credentials in the filesystem
  Router_SSID = ESPAsync_wifiManager.WiFi_SSID();
  Router_Pass = ESPAsync_wifiManager.WiFi_Pass();
  
  
  ssid.toUpperCase();
  password = "My" + ssid;


  // RoSchmi new
  // Extra parameters to be configured
  // After connecting, parameter.getValue() will get you the configured value
  // Format: <ID> <Placeholder text> <default value> <length> <custom HTML> <label placement>
  
  ESPAsync_WMParameter p_azureAccountName(AzureAccountName_Label, "Azure Storage Account Name", azureAccountName, 20);
  ESPAsync_WMParameter p_azureAccountKey(AzureAccountKey_Label, "Azure Storage Account Key", "", 90);
  ESPAsync_WMParameter p_viessmannClientId(ViessmannClientId_Label, "Viessmann Client Id", viessmannClientId, 50);
  ESPAsync_WMParameter p_viessmannRefreshToken(ViessmannRefreshToken_Label, "Viessmann Refresh Token", "", 60);
  ESPAsync_WMParameter p_soundSwitcherThreshold(SoundSwitcherThresholdString_Label, "Noise Threshold", sSwiThresholdStr, 6);
  // Just a quick hint
  ESPAsync_WMParameter p_hint("<small>*Hint: if you want to reuse the currently active WiFi credentials, leave SSID and Password fields empty. <br/>*Portal Password = MyESP_'hexnumber'</small>");
  ESPAsync_WMParameter p_hint2("<small><br/>*Hint: to enter the Azure Key, Viessmann Client Id and Viessmann Refresh Token send them to your Phone by E-Mail and use copy and paste.<br/></small>");
    
  //add all parameters here
  ESPAsync_wifiManager.addParameter(&p_hint);
  ESPAsync_wifiManager.addParameter(&p_hint2);
  ESPAsync_wifiManager.addParameter(&p_azureAccountName);
  ESPAsync_wifiManager.addParameter(&p_azureAccountKey);
  ESPAsync_wifiManager.addParameter(&p_viessmannClientId);
  ESPAsync_wifiManager.addParameter(&p_viessmannRefreshToken);
  ESPAsync_wifiManager.addParameter(&p_soundSwitcherThreshold);

  // Check if there are stored WiFi router/password credentials.
  // If not found, device will remain in configuration mode until switched off via webserver.
  Serial.println(F("Opening configuration portal."));
  
  bool configWiFiDataLoaded = false;

  // From v1.1.0, Don't permit NULL password
  if ( (Router_SSID != "") && (Router_Pass != "") )
  {
    LOGERROR3(F("From v1.1.0 * Add SSID = "), Router_SSID, F(", PW = "), Router_Pass);
    wifiMulti.addAP(Router_SSID.c_str(), Router_Pass.c_str());
    ESPAsync_wifiManager.getSSID();
    ESPAsync_wifiManager.setConfigPortalTimeout(60); //If no access point name has been previously entered disable timeout.
    Serial.println(F("Here we could print the Self-Stored Router WiFi-Credentials"));
    //Remove this line if you do not want to see WiFi password printed
    LOGERROR3(F("ESP Self-Stored Credentials :  "), Router_SSID, F(", PW = "), Router_Pass);
  }
  else
  {
    LOGERROR3(F("From v1.1.0 * Neglect ESP-Self_Stored SSID = "), Router_SSID, F(", PW = "), Router_Pass);
  }
  
  if (loadWiFiConfigData())   // Load credentials for Router WiFi STA connection from SPIFFS/LittleFS    
  {
    configWiFiDataLoaded = true;
    
    ESPAsync_wifiManager.setConfigPortalTimeout(60); //If no access point name has been previously entered disable timeout.
    Serial.println(F("Got stored Credentials. Timeout 60s for Config Portal"));
    
    // Added by RoSchmi
    // Store credentials read from file in backstore for later use
    memcpy(&Loaded_WM_config, &WM_config, sizeof(Loaded_WM_config));
    
    LOGERROR(F("Could print Credentials, loaded and saved in backstore"));
    for (uint8_t i = 0; i < NUM_WIFI_CREDENTIALS; i++)
    {
    LOGERROR3(F("SSID: "), Loaded_WM_config.WiFi_Creds[i].wifi_ssid, F(", PW = "), Loaded_WM_config.WiFi_Creds[i].wifi_pw);
    }
    


#if DISPLAY_STORED_CREDENTIALS_IN_CP    // Cave: This directive is alse used in ESPAsync_WiFiManger
    // New. Update Credentials, got from loadWiFiConfigData(), to display on CP
    
    // Cave:dangerous, the passwords should never be shown
    
    ESPAsync_wifiManager.setCredentials(WM_config.WiFi_Creds[0].wifi_ssid, WM_config.WiFi_Creds[0].wifi_pw,
                                        WM_config.WiFi_Creds[1].wifi_ssid, WM_config.WiFi_Creds[1].wifi_pw); 
#endif
    
#if USE_ESP_WIFIMANAGER_NTP      
    if ( strlen(WM_config.TZ_Name) > 0 )
    {
      LOGERROR3(F("Current TZ_Name ="), WM_config.TZ_Name, F(", TZ = "), WM_config.TZ);

