RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
  analogSensorMgr_Vi_01.SetReadInterval(API_ANALOG_SENSOR_READ_INTERVAL_SECONDS);
  
  httpCode = refresh_Vi_AccessTokenFromApi((const char*)"dummyCaCert", myViessmannApiAccountPtr, viessmannRefreshToken);
  if (httpCode == t_http_codes::HTTP_CODE_OK)
  {   
    AccessTokenRefreshTime = dateTimeUTCNow;
  }
  else
  {     
    Serial.println(F("Couldn't refresh accessToken from Viessmann Cloud. Error message is:"));
    Serial.println((char*)bufferStorePtr);
    ESP.restart();
    while(true)
    {
      delay(500);
    }
  }

  httpCode = read_Vi_UserFromApi((const char*)"dummyCaCert", myViessmannApiAccountPtr);
  if (httpCode == t_http_codes::HTTP_CODE_OK)
  {
    Serial.println(F("UserId successfully read from Viessmann Cloud"));
    Serial.println(F(""));
    viessmannUserId_is_read = true;    
  }
  else
  {     
    Serial.println(F("Couldn't read UserId from Viessmann Cloud.\r\nError message is:"));
    #if FLASH_LOGGING == 1
        addLogEntry(LOG_FILE, "10", "Couldn't read user", LOGGING_ENTRIES);
    #endif
    Serial.println((char*)bufferStorePtr);
    ESP.restart();
    while(true)
    {
      delay(500);
    }
  }

  httpCode = read_Vi_EquipmentFromApi((const char*)"dummyCaCert", myViessmannApiAccountPtr, &Data_0_Id, equipBufLen, Data_0_Description, Data_0_Address_Street, Data_0_Address_HouseNumber, Gateways_0_Serial, Gateways_0_Devices_0_Id);
  if (httpCode == t_http_codes::HTTP_CODE_OK)
  {
    Serial.println(F("Equipment successfully read from Viessmann Cloud"));
    viessmannEquip_is_read = true;
  }
  else
  {
    #if FLASH_LOGGING == 1
        addLogEntry(LOG_FILE, "15", "Couldn't read equipment", LOGGING_ENTRIES);
    #endif     
    Serial.println(F("Couldn't read Equipment from Viessmann Cloud.\r\nError message is:"));
    Serial.println((char*)bufferStorePtr);
    // RoSchmi
    
    ESP.restart();
    while(true)
    {
      delay(500);
    }
      
  }
}
 
   #pragma region Routine read_Vi_UserFromApi(...)
t_httpCode read_Vi_UserFromApi(X509Certificate pCaCert, ViessmannApiAccount * viessmannApiAccountPtr)
{
  WiFiClient * selectedClient = viessmannApiAccountPtr -> UseHttps ? &secure_wifi_client : &plain_wifi_client;
  
  if (viessmannApiAccountPtr -> UseHttps && !(viessmannApiAccountPtr -> UseCaCert))
  {
    secure_wifi_client.setInsecure();
  }
  
  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, selectedClient, bufferStorePtr);
   #if SERIAL_PRINT == 1
        // Serial.println(myViessmannApiAccount.ClientId);
      #endif
      memset(viessmannApiUser,'\0', viessmannUserBufLen);
      memset(bufferStorePtr,'\0', bufferStoreLength);
      t_httpCode responseCode = viessmannClient.GetUser(bufferStorePtr, bufferStoreLength);
      Serial.printf("\r\nUser: httpResponseCode is: %d\r\n", responseCode);
      
      if (responseCode == t_http_codes::HTTP_CODE_OK)
      {
        uint16_t cntToCopy = strlen((char*)bufferStorePtr) < viessmannUserBufLen ? strlen((char*)bufferStorePtr) : viessmannUserBufLen -1;
        memcpy(viessmannApiUser, bufferStorePtr, cntToCopy);       
      }    
return responseCode;
}
#pragma endregion

#pragma region Routine read_Vi_EquipmentFromApi(...)
t_httpCode read_Vi_EquipmentFromApi(X509Certificate pCaCert, ViessmannApiAccount * viessmannApiAccountPtr, uint32_t * p_data_0_id, const int equipBufLen, char * p_data_0_description, char * p_data_0_address_street, char * p_data_0_address_houseNumber, char * p_gateways_0_serial, char * p_gateways_0_devices_0_id)
{
  WiFiClient * selectedClient = viessmannApiAccountPtr -> UseHttps ? &secure_wifi_client : &plain_wifi_client;

  if (viessmannApiAccountPtr -> UseHttps && !(viessmannApiAccountPtr -> UseCaCert))
  {
    secure_wifi_client.setInsecure();
  }
  
  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif
  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, selectedClient, bufferStorePtr);
   #if SERIAL_PRINT == 1
        //Serial.println(myViessmannApiAccount.ClientId);
      #endif
      
      memset(bufferStorePtr, '\0', bufferStoreLength); 
      t_httpCode responseCode = viessmannClient.GetEquipment(bufferStorePtr, bufferStoreLength);
          
      Serial.printf("\r\nEquipment httpResponseCode is: %d\r\n", responseCode);

      if (responseCode == t_http_codes::HTTP_CODE_OK)
      {
        const char* json = (char *)bufferStorePtr;
        JsonDocument doc;
        deserializeJson(doc, json);
        
        uint32_t data_0_id = doc["data"][0]["id"];
        const char * data_0_description = doc["data"][0]["description"];
        const char * data_0_address_street = doc["data"][0]["address"]["street"];
        const char * data_0_address_houseNumber = doc["data"][0]["address"]["houseNumber"];
        const char * gateways_0_serial = doc["data"][0]["gateways"][0]["serial"];
        const char * gateways_0_devices_0_id = doc["data"][0]["gateways"][0]["devices"][0]["id"];
        
        *p_data_0_id = data_0_id;
        memset(bufferStorePtr, '\0', bufferStoreLength);
         
        memset(p_data_0_description, '\0', equipBufLen);
        memset(p_data_0_address_street, '\0', equipBufLen);
        memset(p_data_0_address_houseNumber,'\0', equipBufLen);

        memset(p_gateways_0_serial,'\0', equipBufLen);
        memset(p_gateways_0_devices_0_id,'\0', equipBufLen);

        strncpy(p_data_0_description, data_0_description, equipBufLen - 1);
        strncpy(p_data_0_address_street, data_0_address_street, equipBufLen - 1);
        strncpy(p_data_0_address_houseNumber, data_0_address_houseNumber, equipBufLen - 1);

        strncpy(p_gateways_0_serial, gateways_0_serial, equipBufLen - 1);
        strncpy(p_gateways_0_devices_0_id, gateways_0_devices_0_id, equipBufLen - 1);       
      }
  return responseCode; 
}
#pragma endregion


#pragma region loop()
void loop()
{
  check_status();   // Checks if WiFi is still connected
                    // if not, try other Accesspoint
  // put your main code here, to run repeatedly:
  if (++loopCounter % 100000 == 0)   // Make decisions to send data every 100000 th round and toggle Led to signal that App is running
  {

