RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
#pragma region Routine ReadViessmannApi_Analog_01(pSensorIndex, const char* pSensorName, int pValueIndex, * pViessmannApiSelectionPtr)
VI_Feature ReadViessmannApi_Analog_01(int pSensorIndex, const char* pSensorName, int pValueIndex, ViessmannApiSelection * pViessmannApiSelectionPtr)
{
  // Use values read from the Viessmann API
  // pSensorIndex determins the position (from 4). 
  // pSensorName is the name of the feature (see ViessmannApiSelection.h)
 
  // preset a 'returnFeature' with value = MAGIC_NUMBER_INVALID (999.9)
  // Save lastReadTimeSeconds and readIntervalSeconds
  int64_t tempLastReadTimeSeconds = pViessmannApiSelectionPtr -> lastReadTimeSeconds;
  int32_t tempReadIntervalSeconds = pViessmannApiSelectionPtr ->readIntervalSeconds;
 
  VI_Feature returnFeature;
  strncpy(returnFeature.values[pValueIndex].value, (floToStr(MAGIC_NUMBER_INVALID)).c_str(), sizeof(returnFeature.values[pValueIndex].value) - 1);
  
  int64_t utcNowSecondsTime = (int64_t)dateTimeUTCNow.secondstime();
  int64_t remaining_Vi_seconds = tempLastReadTimeSeconds + tempReadIntervalSeconds - utcNowSecondsTime;
  
  if (pSensorIndex == 0)
  {
    Serial.printf("Remaining seconds to read (Vi): %d\n",  (int32_t)remaining_Vi_seconds);
  }

  // Only read features from the cloud when readInterval has expired
  if ((tempLastReadTimeSeconds + tempReadIntervalSeconds) < utcNowSecondsTime) 
  { 
      Serial.println(F("########## Have to read Vi-Features #########\n"));
      
      t_httpCode httpCode = read_Vi_FeaturesFromApi(myX509Certificate, myViessmannApiAccountPtr, Data_0_Id, Gateways_0_Serial, Gateways_0_Devices_0_Id, pViessmannApiSelectionPtr);
         
      if (httpCode == t_http_codes::HTTP_CODE_OK)
      {
        pViessmannApiSelectionPtr ->lastReadTimeSeconds = utcNowSecondsTime;
        
        Serial.println(F("Succeeded to read Features from Viessmann Cloud\n"));
        
        //Serial.printf("OK-Vi-LastReadTime: %u dateTimeUTCNow: %u, Interval: %u\n", (uint32_t)pViessmannApiSelectionPtr ->lastReadTimeSeconds, dateTimeUTCNow.secondstime(), pViessmannApiSelectionPtr ->readIntervalSeconds); 
      }
      else
      {
        pViessmannApiSelectionPtr ->lastReadTimeSeconds = utcNowSecondsTime;
         
        Serial.println(F("Failed to read Features from Viessmann Cloud"));
        Serial.printf("Else-LastReadTime: %u dateTimeUTCNow: %u, Interval: %u\n", (uint32_t)viessmannApiSelection_01.lastReadTimeSeconds, dateTimeUTCNow.secondstime(), (uint32_t)viessmannApiSelection_01.readIntervalSeconds); 
        //Serial.println((char*)bufferStorePtr);
       } 
  }
  
  if (analogSensorMgr_Vi_01.HasToBeRead(pSensorIndex, dateTimeUTCNow))
  {     
    //for (int i = 0; i < VI_FEATURES_COUNT; i++)
    for (int i = 0; i < ViessmannApiSelection::NUM_INTERESTING_PROPERTIES; i++)
    {       
      if (strcmp((const char *)vi_features[i].name, pSensorName) == 0)
      {
        returnFeature = vi_features[i];
        analogSensorMgr_Vi_01.SetReadTimeAndValues(pSensorIndex, dateTimeUTCNow, atof(returnFeature.values[pValueIndex].value), 0.0f, MAGIC_NUMBER_INVALID);           
        break;
      }
    } 
  } 
  return returnFeature;
}
#pragma endregion

float ReadAnalogSensor(int pSensorIndex)
{
#ifndef USE_SIMULATED_SENSORVALUES
            // Use values read from an analog source
            // Change the function for each sensor to your needs

            double theRead = MAGIC_NUMBER_INVALID;           
            if (analogSensorMgr.HasToBeRead(pSensorIndex, dateTimeUTCNow))
            {                              
              switch (pSensorIndex)
              {
                case 0:
                    {
                      // must be called in the first case
                      feedResult = soundSwitcher.feed();
                      if (feedResult.isValid)  
                      {
                        float soundValues[2] = {0};
                        soundValues[0] = feedResult.avValue;
                        soundValues[1] = feedResult.highAvValue;
                        analogSensorMgr.SetReadTimeAndValues(pSensorIndex, dateTimeUTCNow, soundValues[1], soundValues[0], MAGIC_NUMBER_INVALID);                 
                        //theRead = feedResult.highAvValue / 10;
                        // Function not used in this App, can be used to display another sensor
                        // theRead = MAGIC_NUMBER_INVALID;
                      } 

                      // As an example we use it here to display an analog value read from the Viessmann Api   
                      
                      // Possible way to get a Viessmann Api Sensor value
                      VI_Feature featureValue = ReadViessmannFeatureFromSelection("heating.sensors.temperature.outside", VI_FEATURES_COUNT);
                      theRead = atof((char *)featureValue.values[0].value);

                      // This is an alternative way to get a Viessmann Api Sensor valu                      
                      /*
                      SampleValueSet featureValueSet = dataContainerAnalogViessmann01.getCheckedSampleValues(dateTimeUTCNow, false);         
                      theRead = featureValueSet.SampleValues[1].Value;
                      */
                     
                      #if SERIAL_PRINT == 1
                        //Serial.printf("\r\nApi-Sensor: %.1f\r\n", theRead);
                      #endif

                      // Take theRead (nearly) 0.0 as invalid
                      // (if no sensor is connected the function returns 0)                        
                      if (theRead > - 0.00001 && theRead < 0.00001)
                      {
                        theRead = MAGIC_NUMBER_INVALID;
                      }                                                                                                    
                    }
                    break;                   
                case 1:
                    {
                      if (feedResult.isValid)  
                      {
                        float soundValues[2] = {0};
                        soundValues[0] = feedResult.avValue;
                        soundValues[1] = feedResult.highAvValue;
                        
