RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
#pragma region Routine read_Vi_FeaturesFromApi(...)
t_httpCode read_Vi_FeaturesFromApi(X509Certificate pCaCert, ViessmannApiAccount * pViessmannApiAccountPtr, const uint32_t data_0_id, const char * p_gateways_0_serial, const char * p_gateways_0_devices_0_id, ViessmannApiSelection * apiSelectionPtr)
{
  WiFiClient * selectedClient = (pViessmannApiAccountPtr -> UseHttps) ? &secure_wifi_client : &plain_wifi_client;
  //Serial.printf("Have selected Client \n");
  if ((pViessmannApiAccountPtr -> UseHttps) && !(pViessmannApiAccountPtr -> UseCaCert))
  {
    secure_wifi_client.setInsecure();
    //Serial.println("Setting Viessmann Client insecure\n");
  }

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  int64_t tempLastReadTimeSeconds = apiSelectionPtr -> lastReadTimeSeconds;
  int32_t tempReadIntervalSeconds = apiSelectionPtr ->readIntervalSeconds;
  //ViessmannApiSelection tempViessmannApiSelection(tempLastReadTimeSeconds, tempReadIntervalSeconds);
  
  //ViessmannApiSelection * apiSelectionPtr = &tempViessmannApiSelection;
  
  memset(bufferStorePtr, '\0', bufferStoreLength);
  
  
  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, selectedClient, bufferStorePtr);
  
  Serial.printf("\r\n(%u) ",loadViFeaturesCount);
  Serial.printf("%i/%02d/%02d %02d:%02d ", localTime.year(), 
                                        localTime.month() , localTime.day(),
                                        localTime.hour() , localTime.minute());
   
  t_httpCode responseCode = viessmannClient.GetFeatures(bufferStorePtr, bufferStoreLength, data_0_id, Gateways_0_Serial, Gateways_0_Devices_0_Id, apiSelectionPtr);

  Serial.printf("(%u) Viessmann Features: httpResponseCode is: %d\r\n", loadViFeaturesCount, responseCode);
  if (responseCode == t_http_codes::HTTP_CODE_OK)
  {
    //pApiSelectionPtr ->lastReadTimeSeconds = dateTimeUTCNow.secondstime();
    
    loadViFeaturesCount++;
    // After each successful request error counters are reset
    loadViFeaturesResp400Count = 0;
    loadViFeaturesRespOtherCount = 0;

    //RoSchmi: if timestamp of first feature is empty, 
    // propably something went wrong --> restart 
    if (vi_features[0].timestamp[0] == '\0')
    {
      #if FLASH_LOGGING == 1
      addLogEntry(LOG_FILE, "25", "Viessmann can't read timestamp", LOGGING_ENTRIES);
      #endif
      Serial.println("Unknown timestamp was found. Rebooting\n");
      for (int i2 = 0; i2 < 5; i2++)
      {
        delay(500);
      }
      ESP.restart();
      while(true)
      {
        delay(500);
      }
    }
       
    // Get 4 On/Off sensor values which were read from the Viessmann Api
    // and store them in a 'twin' of the sensor, reflecting its state
    
    OnOffBurnerStatus.Feed(strcmp(getFeatureByName(vi_features, VI_FEATURES_COUNT, "heating.burners.0")->values[0].value, "true") == 0, dateTimeUTCNow);
    OnOffCirculationPumpStatus.Feed(strcmp(getFeatureByName(vi_features, VI_FEATURES_COUNT, "heating.circuits.0.circulation.pump")->values[0].value, "on") == 0, dateTimeUTCNow);   
    OnOffDhwCircualtionPumpStatus.Feed(strcmp(getFeatureByName(vi_features, VI_FEATURES_COUNT, "heating.dhw.pumps.circulation")->values[0].value, "on") == 0, dateTimeUTCNow); 
    OnOffDhwPrimaryPumpStatus.Feed(strcmp(getFeatureByName(vi_features, VI_FEATURES_COUNT, "heating.dhw.pumps.primary")->values[0].value, "on") == 0, dateTimeUTCNow);    
  }
  else
  {
    
    if (responseCode == 400)
    {
      loadViFeaturesResp400Count++;
    }
    else
    {
      loadViFeaturesRespOtherCount++;
    }
    Serial.printf("Bad httpResponses, Code 400: %d, Others: %d\n", loadViFeaturesResp400Count, loadViFeaturesRespOtherCount);
  
    if (loadViFeaturesResp400Count > 20 || loadViFeaturesRespOtherCount > 20)
    {
      #if FLASH_LOGGING == 1
        addLogEntry(LOG_FILE, "30", "Viessmann failed requests", LOGGING_ENTRIES);
      #endif
      Serial.printf("Rebooting, failed Vi-Requests. 400: %d, others: %d\n", loadViFeaturesResp400Count, loadViFeaturesRespOtherCount);
      ESP.restart();
      while(true)
      {
        delay(500); //Wait for ever
      }
    }

    bufferStorePtr[bufferStoreLength - 1] = '\0';
    Serial.println((char *)bufferStorePtr);
  }
  
  return responseCode;
}
#pragma endregion

#pragma region Routine refresh_Vi_AccessTokenFromApi(...)
t_httpCode refresh_Vi_AccessTokenFromApi(X509Certificate pCaCert, ViessmannApiAccount * viessmannApiAccountPtr, const char * refreshToken)
{
  WiFiClient * selectedClient = viessmannApiAccountPtr -> UseHttps ? &secure_wifi_client : &plain_wifi_client;
  
  if (viessmannApiAccountPtr -> UseHttps && !(viessmannApiAccountPtr -> UseCaCert))
  {
    secure_wifi_client.setInsecure();
  }
  
  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  const char * accessTokenLabel = "access_token";
  const char * refreshTokenLabel = "refresh_token";
  const char * tokenTypeLabel = "token_type";
  
  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, selectedClient, bufferStorePtr); 
      memset(bufferStorePtr,'\0', bufferStoreLength);
      t_httpCode responseCode = viessmannClient.RefreshAccessToken(bufferStorePtr, bufferStoreLength, refreshToken);
      
      Serial.printf("\n(%u) %i/%02d/%02d %02d:%02d ", loadRefreshTokenCount, localTime.year(), 
                                        localTime.month() , localTime.day(),
                                        localTime.hour() , localTime.minute());
      Serial.println(F("Refreshing Access Token"));
      Serial.printf("(%u) Refresh Token: httpResponseCode: %d\r\n\r\n", loadRefreshTokenCount++, responseCode);
      
      if (responseCode == t_http_codes::HTTP_CODE_OK)
      {    
         #if SERIAL_PRINT == 1
            Serial.printf("%s\n", (char *)bufferStorePtr);
         #endif
         bool tokenIsValid = true;
         char * posAcTok = strnstr((char *)bufferStorePtr, (const char *)"access_token", 50);
         char * posRefrTok = strnstr((char *)bufferStorePtr, (const char *)"refresh_token", 2000);
         char * posTokType = strnstr((char *)bufferStorePtr, (const char *)"token_type", 2000);

         tokenIsValid = posAcTok == nullptr ? false : tokenIsValid;
         tokenIsValid = posRefrTok == nullptr ? false : tokenIsValid;
         tokenIsValid = posTokType == nullptr ? false : tokenIsValid;
         
         tokenIsValid = (tokenIsValid && (posAcTok < posRefrTok) && (posRefrTok < posTokType)) ? true : false;

