RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
         if (tokenIsValid)
         {
            char * startAcTok = posAcTok + strlen(accessTokenLabel) + 3;
            char * endAcTok = posRefrTok - 4;
            size_t acTokenLength = (size_t)endAcTok + 1 - (size_t)startAcTok;
            #if SERIAL_PRINT == 1
                Serial.printf("\nTokenlength is: %d\n", acTokenLength);
            #endif
            memcpy(viessmannAccessToken, startAcTok, acTokenLength);
            viessmannAccessToken[acTokenLength] = '\0';
            myViessmannApiAccountPtr ->RenewAccessToken(String(viessmannAccessToken));   
         }
         else
         {
            responseCode = HTTPC_ERROR_SEND_PAYLOAD_FAILED;
            Serial.println(F("Content error. Refreshing Accesstoken failed!\n"));
            bufferStorePtr[bufferStoreLength - 1] = '\0';
            Serial.println((char *)bufferStorePtr);
         }
      }
      else
      {  
        Serial.println(F("Response Error. Refreshing Accesstoken failed!\n"));   
        bufferStorePtr[bufferStoreLength - 1] = '\0';
        Serial.println((char *)bufferStorePtr);
      }
   return responseCode;
      
}
#pragma endregion

az_http_status_code createTable(CloudStorageAccount *pAccountPtr, X509Certificate pCaCert, const char * pTableName)
{ 

  #if AZURE_TRANSPORT_PROTOCOL == 1
    static WiFiClientSecure wifi_client;
  #else
    static WiFiClient wifi_client;
  #endif

    #if AZURE_TRANSPORT_PROTOCOL == 1
    wifi_client.setCACert(myX509Certificate);
    //wifi_client.setCACert(baltimore_corrupt_root_ca);
  #endif

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif
  
  // RoSchmi
  TableClient table(pAccountPtr, pCaCert,  httpPtr, &wifi_client, bufferStorePtr);

  // Create Table
  az_http_status_code statusCode = table.CreateTable(pTableName, dateTimeUTCNow, ContType::contApplicationIatomIxml, AcceptType::acceptApplicationIjson, returnContent, false);
  
   // RoSchmi for tests: to simulate failed upload
   //az_http_status_code   statusCode = AZ_HTTP_STATUS_CODE_UNAUTHORIZED;

  char codeString[35] {0};
  if ((statusCode == AZ_HTTP_STATUS_CODE_CONFLICT) || (statusCode == AZ_HTTP_STATUS_CODE_CREATED))
  {
    #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
    #endif
   
      sprintf(codeString, "%s %i", "Table available: ", az_http_status_code(statusCode));
      #if SERIAL_PRINT == 1
        Serial.println((char *)codeString);
      #endif
  
  }
  else
  {
      sprintf(codeString, "%s %i", "Table Creation failed: ", az_http_status_code(statusCode));
      #if SERIAL_PRINT == 1   
        Serial.println((char *)codeString);
      #endif
 
    delay(1000);

    ESP.restart();
    
  }
return statusCode;
}

az_http_status_code insertTableEntity(CloudStorageAccount *pAccountPtr,  X509Certificate pCaCert, const char * pTableName, TableEntity pTableEntity, char * outInsertETag)
{ 
  #if AZURE_TRANSPORT_PROTOCOL == 1
    static WiFiClientSecure wifi_client;
  #else
    static WiFiClient wifi_client;
  #endif
  
  #if AZURE_TRANSPORT_PROTOCOL == 1
    wifi_client.setCACert(myX509Certificate); 
  #endif
  
  /*
  // For tests: Try second upload with corrupted certificate to provoke failure
  #if AZURE_TRANSPORT_PROTOCOL == 1
    wifi_client.setCACert(myX509Certificate);
    if (insertCounterAnalogTable == 2)
    {
      wifi_client.setCACert(baltimore_corrupt_root_ca);
    }
  #endif
  */

  TableClient table(pAccountPtr, pCaCert,  httpPtr, &wifi_client, bufferStorePtr);

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif
  
  DateTime responseHeaderDateTime = DateTime();   // Will be filled with DateTime value of the resonse from Azure Service

  // Insert Entity
  az_http_status_code statusCode = table.InsertTableEntity(pTableName, dateTimeUTCNow, pTableEntity, (char *)outInsertETag, &responseHeaderDateTime, ContType::contApplicationIatomIxml, AcceptType::acceptApplicationIjson, ResponseType::dont_returnContent, false);
  
  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  lastResetCause = 0;
  tryUploadCounter++;

   // RoSchmi for tests: to simulate failed upload
  //az_http_status_code   statusCode = AZ_HTTP_STATUS_CODE_UNAUTHORIZED;
  
  if ((statusCode == AZ_HTTP_STATUS_CODE_NO_CONTENT) || (statusCode == AZ_HTTP_STATUS_CODE_CREATED))
  {
      char codeString[35] {0};
      sprintf(codeString, "%s %i", "Entity inserted: ", statusCode);
      #if SERIAL_PRINT == 1
        Serial.println((char *)codeString);
      #endif

      Serial.printf("\r\n%s %s %i\r\n", pTableName, "Entity inserted: ", az_http_status_code(statusCode));
    
    #if UPDATE_TIME_FROM_AZURE_RESPONSE == 1    // System time shall be updated from the DateTime value of the response ?
    
    dateTimeUTCNow = responseHeaderDateTime;
    
    char buffer[] = "Azure-Utc: YYYY-MM-DD hh:mm:ss";
    dateTimeUTCNow.toString(buffer);
    #if SERIAL_PRINT == 1
      Serial.println((char *)buffer);
      Serial.println("");
    #endif
    
    #endif   
  }
  else            // request failed
  {               // note: internal error codes from -1 to -11 were converted for tests to error codes 401 to 411 since
                  // negative values cannot be returned as 'az_http_status_code' 

    failedUploadCounter++;
    //sendResultState = false;
    lastResetCause = 100;      // Set lastResetCause to arbitrary value of 100 to signal that post request failed
    
    
      char codeString[35] {0};
      sprintf(codeString, "%s %i", "Insertion failed: ", az_http_status_code(statusCode));
      #if SERIAL_PRINT == 1
        Serial.println((char *)codeString);
      #endif
  
    
    #if REBOOT_AFTER_FAILED_UPLOAD == 1   // When selected in config.h -> Reboot through SystemReset after failed uoload

        #if AZURE_TRANSPORT_PROTOCOL == 1         
          ESP.restart();        
        #endif
        #if AZURE_TRANSPORT_PROTOCOL == 0     // for http requests reboot after the second, not the first, failed request
          if(failedUploadCounter > 1)
          {
            ESP.restart();
          }
    #endif

    #endif

    #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();  
    #endif
    delay(1000);
  }  
  return statusCode;
}



void print_reset_reason(RESET_REASON reason)
{
  switch ( reason)
  {
    case 1 : Serial.println ("POWERON_RESET");break;          /**<1, Vbat power on reset*/
    case 3 : Serial.println ("SW_RESET");break;               /**<3, Software reset digital core*/
    case 4 : Serial.println ("OWDT_RESET");break;             /**<4, Legacy watch dog reset digital core*/
    case 5 : Serial.println ("DEEPSLEEP_RESET");break;        /**<5, Deep Sleep reset digital core*/
    case 6 : Serial.println ("SDIO_RESET");break;             /**<6, Reset by SLC module, reset digital core*/
    case 7 : Serial.println ("TG0WDT_SYS_RESET");break;       /**<7, Timer Group0 Watch dog reset digital core*/
    case 8 : Serial.println ("TG1WDT_SYS_RESET");break;       /**<8, Timer Group1 Watch dog reset digital core*/
    case 9 : Serial.println ("RTCWDT_SYS_RESET");break;       /**<9, RTC Watch dog Reset digital core*/
    case 10 : Serial.println ("INTRUSION_RESET");break;       /**<10, Instrusion tested to reset CPU*/
    case 11 : Serial.println ("TGWDT_CPU_RESET");break;       /**<11, Time Group reset CPU*/
    case 12 : Serial.println ("SW_CPU_RESET");break;          /**<12, Software reset CPU*/
    case 13 : Serial.println ("RTCWDT_CPU_RESET");break;      /**<13, RTC Watch dog Reset CPU*/
    case 14 : Serial.println ("EXT_CPU_RESET");break;         /**<14, for APP CPU, reseted by PRO CPU*/
    case 15 : Serial.println ("RTCWDT_BROWN_OUT_RESET");break;/**<15, Reset when the vdd voltage is not stable*/
    case 16 : Serial.println ("RTCWDT_RTC_RESET");break;      /**<16, RTC Watch dog reset digital core and rtc module*/
    default : Serial.println ("NO_MEAN");
  }
}

















